tap "homebrew/services"
brew "xz"
brew "autoconf"
brew "automake"
brew "bat"
brew "boost"
brew "btop"
brew "c-kermit"
brew "cloc"
brew "cmake"
brew "cmake-docs"
brew "colordiff"
brew "cowsay"
brew "ctags"
brew "d2"
brew "fastfetch"
brew "opus"
brew "x265"
brew "ffmpeg"
brew "fortune"
brew "gcc"
brew "go@1.20"
brew "gping"
brew "readline"
brew "python@3.12"
brew "libtool"
brew "graphviz"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jmeter"
brew "jq"
brew "libevent"
brew "mbedtls"
brew "minicom"
brew "mtr"
brew "mysql@8.0"
brew "neofetch"
brew "netcat"
brew "nginx", restart_service: :changed
brew "ninja"
brew "nmap"
brew "nvm"
brew "ollama", restart_service: :changed
brew "onefetch"
brew "portaudio"
brew "pssh"
brew "pstree"
brew "python-tk@3.13"
brew "python@3.9"
brew "rust"
brew "rustup"
brew "sniffnet"
brew "swig"
brew "tcpdump"
brew "telnet"
brew "tldr"
brew "tree"
brew "uv"
brew "wget"
brew "yq"
brew "zinit"
cask "claude-code"
cask "font-hack-nerd-font"
cask "lulu"
vscode "adamhartford.vscode-base64"
vscode "ahmadalli.vscode-nginx-conf"
vscode "bibhasdn.unique-lines"
vscode "cymonk.sql-formatter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "drblury.protobuf-vsc"
vscode "eamodio.gitlens"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "infranodus.infranodus-graph-view"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "joshuapoehls.json-escaper"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "mhutchie.git-graph"
vscode "mrkou47.thrift-syntax-support"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "raynigon.nginx-formatter"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shanoor.vscode-nginx"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "terrastruct.d2"
vscode "twxs.cmake"
vscode "tyriar.sort-lines"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "william-voyek.vscode-nginx"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
