tap "homebrew/services"
brew "xz"
brew "autoconf"
brew "automake"
brew "bat"
brew "boost"
brew "btop"
brew "c-kermit"
brew "cloc"
brew "cmake"
brew "cmake-docs"
brew "colordiff"
brew "cowsay"
brew "ctags"
brew "d2"
brew "fastfetch"
brew "opus"
brew "x265"
brew "ffmpeg"
brew "fortune"
brew "gcc"
brew "go@1.20"
brew "gping"
brew "readline"
brew "python@3.12"
brew "libtool"
brew "graphviz"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jmeter"
brew "jq"
brew "libevent"
brew "mbedtls"
brew "minicom"
brew "mtr"
brew "mysql@8.0"
brew "neofetch"
brew "netcat"
brew "nginx", restart_service: :changed
brew "ninja"
brew "nmap"
brew "nvm"
brew "ollama", restart_service: :changed
brew "onefetch"
brew "portaudio"
brew "pssh"
brew "pstree"
brew "python-tk@3.13"
brew "python@3.9"
brew "rust"
brew "rustup"
brew "sniffnet"
brew "swig"
brew "tcpdump"
brew "telnet"
brew "tldr"
brew "tree"
brew "uv"
brew "wget"
brew "yq"
brew "zinit"
cask "claude-code"
cask "font-hack-nerd-font"
cask "lulu"
